// forked from nitoyon's 意味が分からないw　AS3
// forked from 9re's forked from: 意味が分からないw
// forked from paq's 意味が分からないw
package {
    import frocessing.display.*;
    public class FlashTest extends F5MovieClip3D {
        function FlashTest():void {
            colorMode(HSV);
            background(0);
            translate(300,30);
            scale(2);
            rotateX(0.5);
            
            var $:int = -1, ﾟДﾟ:* = box; _
            (ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟДﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟдﾟ)
            (ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟДﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)
            (ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)
            (ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)
            (ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟдﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)
            (ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)
            (ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟДﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)
            (ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)(ﾟдﾟ)
            
            function _(f:*) : Function {
                translate(1-($+1&8^$&8)<<3,$&8^++$&8);
                fill($,255,255);
                f(7);
                return arguments.callee;
            }
            function ﾟдﾟ(i:*) : void {}
        }
    }
}
